In [3]:
import pandas as pd
## create a sample dataframe with a categorical variable and a target variable

In [4]:
df = pd.DataFrame({
    'city':['New York','London','Paris','Tokyo','New York','Paris','Delhi'],
    'price':[200,150,300,250,180,320,100]
})

In [5]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320
6     Delhi    100

In [7]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [8]:
mean_price

{'Delhi': 100.0,
 'London': 150.0,
 'New York': 190.0,
 'Paris': 310.0,
 'Tokyo': 250.0}

In [9]:
df['city_encoded'] = df['city'].map(mean_price)

In [10]:
df[['city_encoded','price']]

   city_encoded  price
0         190.0    200
1         150.0    150
2         310.0    300
3         250.0    250
4         190.0    180
5         310.0    320
6         100.0    100

In [12]:
import seaborn as sns
tips = sns.load_dataset('tips')

In [13]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [14]:
tips[['time']].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [18]:
mean_bill = tips.groupby('time')['total_bill'].mean().to_dict()

C:\Users\user\AppData\Local\Temp\ipykernel_12000\1418129760.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_bill = tips.groupby('time')['total_bill'].mean().to_dict()

In [19]:
mean_bill

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [27]:
tips['time_encoded'] = tips['time'].map(mean_bill)

In [29]:
tips[['total_bill','time_encoded']]

     total_bill time_encoded
0         16.99    20.797159
1         10.34    20.797159
2         21.01    20.797159
3         23.68    20.797159
4         24.59    20.797159
..          ...          ...
239       29.03    20.797159
240       27.18    20.797159
241       22.67    20.797159
242       17.82    20.797159
243       18.78    20.797159

[244 rows x 2 columns]